STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Commissioning/STM32_WPAN/App/app_thread.c
  /* USER CODE BEGIN APP_THREAD_INIT_2 */
  /**
   * Create timer to handle LED toggling
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &APP_THREAD_TimerID, hw_ts_Repeated, APP_THREAD_TimingElapsed);
  HW_TS_Start(APP_THREAD_TimerID, (uint32_t)LED_TIMEOUT);
  /* USER CODE END APP_THREAD_INIT_2 */
}

/**
  * @brief  Trace the error or the warning reported.
  * @param  ErrId :
  * @param  ErrCode
  * @retval None
  */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode)
{
  /* USER CODE BEGIN APP_THREAD_Error_1 */

  /* USER CODE END APP_THREAD_Error_1 */
  switch(ErrId)
  {
  case ERR_REC_MULTI_MSG_FROM_M0 :
    APP_THREAD_TraceError("ERROR : ERR_REC_MULTI_MSG_FROM_M0 ", ErrCode);
    break;
  case ERR_THREAD_SET_STATE_CB :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_STATE_CB ",ErrCode);
    break;
  case ERR_THREAD_ERASE_PERSISTENT_INFO :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_ERASE_PERSISTENT_INFO ",ErrCode);
    break;
  case ERR_THREAD_CHECK_WIRELESS :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ",ErrCode);
    break;
  /* USER CODE BEGIN APP_THREAD_Error_2 */
  case ERR_THREAD_SET_CHANNEL :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_CHANNEL ",ErrCode);
    break;
  case ERR_THREAD_SET_PANID :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_PANID ",ErrCode);
    break;
  case ERR_THREAD_IPV6_ENABLE :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_IPV6_ENABLE ",ErrCode);
    break;
  case ERR_THREAD_START :
    APP_THREAD_TraceError("ERROR: ERR_THREAD_START ", ErrCode);
    break;
  case ERR_TIMER_INIT :
    APP_THREAD_TraceError("ERROR : ERR_TIMER_INIT ", ErrCode);
    break;
  case ERR_TIMER_START :
    APP_THREAD_TraceError("ERROR : ERR_TIMER_START ", ErrCode);
    break;
  case ERR_COMMISSIONER_START :
    APP_THREAD_TraceError("ERROR : ERR_COMMISSIONER_START ", ErrCode);
    break;
  case ERR_COMMISSIONER_CONFIG :
    APP_THREAD_TraceError("ERROR : ERR_COMMISSIONER_CONFIG ", ErrCode);
    break;
  case ERR_THREAD_JOINER_CB :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_JOINER_CB ", ErrCode);
    break;  
  /* USER CODE END APP_THREAD_Error_2 */
  default :
    APP_THREAD_TraceError("ERROR Unknown ", 0);
    break;
  }
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Thread initialization.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error;
  error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error((uint32_t)ERR_THREAD_SET_STATE_CB, (uint32_t)ERR_INTERFACE_FATAL);
  }

  /* USER CODE BEGIN DEVICECONFIG */

  /* USER CODE END DEVICECONFIG */
}

/**
 * @brief Thread notification when the state changes.
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pContext);

  /* USER CODE BEGIN APP_THREAD_STATENOTIF */

  /* USER CODE END APP_THREAD_STATENOTIF */

  if ((NotifFlags & (uint32_t)OT_CHANGED_THREAD_ROLE) == (uint32_t)OT_CHANGED_THREAD_ROLE)
  {
    switch (otThreadGetDeviceRole(NULL))
    {
    case OT_DEVICE_ROLE_DISABLED:
      /* USER CODE BEGIN OT_DEVICE_ROLE_DISABLED */
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END OT_DEVICE_ROLE_DISABLED */
      break;
    case OT_DEVICE_ROLE_DETACHED:
      /* USER CODE BEGIN OT_DEVICE_ROLE_DETACHED */
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END OT_DEVICE_ROLE_DETACHED */
      break;
    case OT_DEVICE_ROLE_CHILD:
      /* USER CODE BEGIN OT_DEVICE_ROLE_CHILD */
      BSP_LED_Off(LED2);
      BSP_LED_On(LED3);
      ToggleBlueLedMode = NO_TOGGLING;
      BSP_LED_On(LED1);
      /* USER CODE END OT_DEVICE_ROLE_CHILD */
      break;
    case OT_DEVICE_ROLE_ROUTER :
      /* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
      BSP_LED_Off(LED2);
      BSP_LED_On(LED3);
      /* USER CODE END OT_DEVICE_ROLE_ROUTER */
      break;
    case OT_DEVICE_ROLE_LEADER :
      /* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */
      BSP_LED_On(LED2);
      BSP_LED_Off(LED3);
      if (APP_THREAD_DeviceIsLeader == TRUE)
      {
        UTIL_SEQ_SetTask(TASK_START_COMMISSIONER, CFG_SCH_PRIO_1);
      }
      ToggleBlueLedMode = NO_TOGGLING;
      BSP_LED_On(LED1);
      /* USER CODE END OT_DEVICE_ROLE_LEADER */
      break;
    default:
      /* USER CODE BEGIN DEFAULT */
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END DEFAULT */
      break;
    }
  }
}

/**
  * @brief  Warn the user that an error has occurred.In this case,
  *         the LEDs on the Board will start blinking.
  *
  * @param  pMess  : Message associated to the error.
  * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
  * @retval None
  */
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode)
{
  /* USER CODE BEGIN TRACE_ERROR */
  APP_DBG("**** Fatal error = %s (Err = %d)", pMess, ErrCode);
  while(1U == 1U)
  {
    BSP_LED_Toggle(LED1);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED2);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED3);
    HAL_Delay(500U);
  }
  /* USER CODE END TRACE_ERROR */
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated informations
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void)
{
  WirelessFwInfo_t wireless_info_instance;
  WirelessFwInfo_t* p_wireless_info = &wireless_info_instance;

  if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
  {
    APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
  }
  else
  {
    APP_DBG("**********************************************************");
    APP_DBG("WIRELESS COPROCESSOR FW:");
    /* Print version */
    APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

    switch(p_wireless_info->StackType)
    {
    case INFO_STACK_TYPE_THREAD_FTD :
      APP_DBG("FW Type : Thread FTD");
      break;
    case INFO_STACK_TYPE_THREAD_MTD :
      APP_DBG("FW Type : Thread MTD");
      break;
    case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC :
      APP_DBG("FW Type : Static Concurrent Mode BLE/Thread");
      break;
    default :
      /* No Thread device supported ! */
      APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
      break;
    }
    APP_DBG("**********************************************************");
  }
}
/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
/**
 * @brief  Period elapsed callback
 * @param  none
 * @retval None
 */
static void APP_THREAD_TimingElapsed(void)
{
  static uint32_t internalFlag = 0;

  internalFlag++;
  if (internalFlag >= 4U)
    internalFlag = 0;

  switch(ToggleBlueLedMode)
  {
  case FAST_TOGGLING : BSP_LED_Toggle(LED1);
  break;

  case SLOW_TOGGLING : if (internalFlag == 0)
    BSP_LED_Toggle(LED1);
  break;
  default : break;
  }
}

/**
 * @brief Commissioner configuration.
 *        This function starts and configure the commissioner.
 * @param  None
 * @retval None
 */
static void APP_THREAD_StartCommissioner(void)
{
  otError error;

  HAL_Delay(1000U);
  APP_DBG("**** APP_THREAD_StartCommissioner");
  /* Start the commissioner */
  error = otCommissionerStart(NULL);

  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_COMMISSIONER_START, error);
  }

  /* Authorize external devices to join */
  error = otCommissionerAddJoiner(NULL, NULL, C_PASSWORD, 120U);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_COMMISSIONER_CONFIG, error);
  }
}

/**
 * @brief Commissioner configuration.
 *        This function starts and configures the commissioner.
 * @param  None
 * @retval None
 */
static void APP_THREAD_ConfigLeaderDevice(void)
{
  otError error;

  APP_DBG("**** APP_THREAD_ConfigLeaderDevice");

  error = otLinkSetChannel(NULL, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL, error);
  }
  error = otLinkSetPanId(NULL, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID, error);
  }
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
  }
  error = otThreadSetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_START, error);
  }
  APP_THREAD_DeviceIsLeader = TRUE;
}

/**
 * @brief Joiner configuration.
 *        This function starts and configures the joiner.
 * @param  None
 * @retval None
 */
static void APP_THREAD_ConfigJoiner(void)
{
  otError error;

  APP_DBG("**** APP_THREAD_ConfigJoiner");
  ToggleBlueLedMode = FAST_TOGGLING;
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
  }

  /* Start the commissioner */
  error = otJoinerStart(NULL,
      C_PASSWORD,
      NULL,
      "OT", /* PACKAGE_NAME */
      "TestAppli",/* OPENTHREAD_CONFIG_PLATFORM_INFO */
      "NA", /* PACKAGE_VERSION */
      NULL, APP_THREAD_JoinerHandler, NULL);

  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_JOINER_START, error);
  }
}

/**
 * @brief Dummy request handler
 * @param
 * @retval None
 */
static void APP_THREAD_JoinerHandler(otError OtError, void *pContext)
{
  if (OtError == OT_ERROR_NONE)
  {
    OtError = otThreadSetEnabled(NULL, true);
    if (OtError != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_THREAD_START, OtError);
    }
  }
  else
    APP_THREAD_Error(ERR_THREAD_JOINER_CB, OtError);
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

